constantAngleSlopeTurbKWUProfileInlet230421GLZ/constantAngleSlopeTurbKWUProfileInlet100621GLZ/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    leftInletWall
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    leftWall
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    rightWall
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    lowerWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    sides
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}



// ************************************************************************* //
