constantAngleSlopeTurbKWUProfileInlet230421GLZ/constantAngleSlopeTurbKWUProfileInlet100621GLZ/constant/turbulencePropertiesPattern
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;

    turbulence      on;

    printCoeffs     on;

alphaK1_pattern
alphaK2_pattern
alphaOmega1_pattern
alphaOmega2_pattern
beta1_pattern
beta2_pattern
betaStar_pattern
gamma1_pattern
gamma2_pattern
a1_pattern
b1_pattern
c1_pattern
        F3          no;
}


// ************************************************************************* //
